{"body": "<div class=\"content\" id=\"doc-contents\">\n  <h1 id=\"welcome-to-the-scalr-apiv2-documentation\">Welcome to the Scalr APIv2 documentation</h1>\n<p>The Scalr API allows you to write scripts or applications to automate tasks on your Scalr-managed \ninfrastructure. It allows you to edit roles, farms, images, launch farms and more.\nThree APIs are defined, to performs actions at the global scope, the account scope or the user scope.\nThe list of all the defined endpoints and the possible responses from the server are available in the\nleft menu, in the User API, Account API and Global API sections. The global API can be used to \nmanage Images and Roles for the whole Scalr installation,\nthe account API can be used to manage environments, orchestration rules, roles or images for an account; while\nthe user API is rather used to manage farms, farm roles, projects or scaling metrics as an user in the account.\nTo learn more about the difference between the global, account and user scopes, visit the corresponding\n<a href=\"https://scalr-wiki.atlassian.net/wiki/display/docs/Administrator+Reference\">documentation page</a>.</p>\n<h2 id=\"getting-started\">Getting started</h2>\n<p>Before using the API, if you are using the enterprise or community editions of Scalr, you must \nenable the API and generate API keys.\nIf you are using the hosted version of Scalr, you only need to generate API keys.</p>\n<h3 id=\"enabling-the-api\">Enabling the API</h3>\n<p>To enable the API, add the following to your <code>/etc/scalr-server/scalr-server.rb</code>\nconfiguration file:</p>\n<pre><code class=\"ruby\">app[:configuration] = {\n  :scalr => {\n    :system => {\n      :api => {\n        :enabled => true,\n        :allowed_origins => '*'\n      },\n    },\n  },\n}</code></pre>\n\n<p class=\"note\">Note that if you already have a <code>app[:configuration]</code> object defined, you should instead\nmerge this in.</p>\n\n<p class=\"caution\">The <code>allowed_origins</code> parameter allows you to control which domains can host browser-based api\nclients that will be allowed access to your API, by using the <code>Access-Control-Allow-Origin</code> HTTP header.\nSetting this to <code>'*'</code> allows any domain to access your\nAPI. For security reasons, you might want to limit this by setting <code>allowed_origins</code> to <code>~</code>, which will\nprevent browser-based clients to access your API, or by setting it to a list of domains, following the\nformat of the <code>Access-Control-Allow-Origin</code> HTTP header. Read more\n<a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS\">here</a>. If you want to use the test client built\ninto the documentation pages, this parameter must include <code>https://api-explorer.scalr.com</code></p>\n\n<p>Run <code>scalr-server-ctl reconfigure</code> to apply the changes.</p>\n<h3 id=\"generating-api-keys\">Generating API keys</h3>\n<p>Login to Scalr as the user you'd like to access the API as, and access the following\nURL: <code>https://your-scalr-host/#/core/api2</code></p>\n<p>Then, generate a new key. Do not forget to save the private key somewhere, as you will not be able to access it again.\nIf you lose the private key, you will have to generate a new API key.</p>\n<p>This key will have the same access rights as the user you're logged in as, so if you are logged in as a regular user, \nthis key will have access only to the User API, if you are logged in as the account owner, this key will have access\nto the User and Account API, and if you are logged in as a global administrator, this key will have access to all APIs.</p>\n<h2 id=\"using-this-documentation\">Using this documentation</h2>\n<p>The menu on the left allows you to browse the API endpoints. You can try \nthe endpoints directly from your browser, so you can test them with your own data. To do so, click on the <strong>AUTHORIZE AND EXECUTE</strong>\nbutton at the bottom of each endpoint description, and fill in your API credentials when asked. You have the possibility to save your \ncredentials in your browser to avoid having to type them again everytime you want to test an endpoint. </p>\n<p class=\"caution\">Be careful, as\nthis is equivalent to giving someone that has access to your computer full access to Scalr. You should also be mindful\nwhen trying the API endpoints, especially with the <b>PATCH</b> and <b>DELETE</b> requests, as there are no safeguards: these API\ncalls will alter or remove your data. We recommend that you start by copying the items you want to work on, and test\nthe API only on the copies.</p>\n\n<h2 id=\"writing-a-client-for-the-scalr-api\">Writing a client for the Scalr API</h2>\n<p>To automate calls to the Scalr API, you need to write a client. You can do so in the programming language of your choice.\nYour client will have to generate HTTP requests that comply with the documentation, and authenticate them with your API credentials.\nThe authentication mechanism is described <a href=\"/authentication/\">here</a>.</p>\n<p>A few examples showing how to use the APIv2 with different programming languages are available <a href=\"https://github.com/scalr-tutorials/apiv2-examples\">on Github</a>. These examples should help getting started with the API, but they are not fully fledged SDKs and they should only be considered an extension to the documentation.</p>\n<h2 id=\"swagger-definitions\">Swagger definitions</h2>\n<p>The <a href=\"http://swagger.io\">swagger</a> definitions for the Scalr user, account and global APIs are available respectively at:</p>\n<ul>\n<li><a href=\"https://my.scalr.com/api/user.v1beta0.yaml\">https://my.scalr.com/api/user.v1beta0.yaml</a></li>\n<li><a href=\"https://my.scalr.com/api/account.v1beta0.yaml\">https://my.scalr.com/api/account.v1beta0.yaml</a></li>\n<li><a href=\"https://my.scalr.com/api/global.v1beta0.yaml\">https://my.scalr.com/api/global.v1beta0.yaml</a></li>\n</ul>\n<p>These API specifications can be used to auto-generate client code in many languages, but you will likely have to\nrewrite the authentication part.</p>\n</div>\n", "title": "Scalr API Documentation"}