{"body": "<div class=\"content\" id=\"doc-contents\">\n  <h1 id=\"request-authentication-algorithm\">Request authentication algorithm</h1>\n<p>Requests to the Scalr API are authenticated with a signature. The signature\nis passed through 3 HTTP headers:</p>\n<ul>\n<li><code>X-Scalr-Key-Id</code>: YYYYYY</li>\n<li><code>X-Scalr-Signature</code>: XXXX</li>\n<li><code>X-Scalr-Date</code>: ISO 8601-formatted TZ-aware (or UTC) date and time.</li>\n</ul>\n<h2 id=\"signature-algorithm\">Signature Algorithm</h2>\n<h3 id=\"signatures\">Signatures</h3>\n<p>The API signature format is: <em>&lt;Signature Version&gt; + &lt;Space&gt; + &lt;Signature&gt;</em>.</p>\n<p>Currently:</p>\n<ul>\n<li><em>Signature Version</em> is the following string: <code>V1-HMAC-SHA256</code></li>\n<li><em>Signature</em> is the base64-encoded HMAC of the canonical request signed using\n    the API Secret Key that corresponds to the API Key ID supplied in the\n    <code>X-Scalr-Key-Id</code> Header.</li>\n</ul>\n<h3 id=\"canonical-request\">Canonical Request</h3>\n<p>The canonical request is defined as the following items joined by newlines (<code>“\\n”</code>):</p>\n<ul>\n<li><code>Method</code>: uppercase HTTP method used (e.g. GET, POST)</li>\n<li><code>Date</code>: the ISO 8601-formatted date passed in the <code>X-Scalr-Date</code> header</li>\n<li><code>Path</code>: the path that was included in the request.</li>\n<li><code>Parameters</code>: canonical query string. See below for more information. If\n    there are no parameters, this should be the empty string.</li>\n<li><code>Body</code>: The body of the request, as included in the request. If the request\n    has no body (e.g. a GET request), this should be the empty string.</li>\n</ul>\n<h3 id=\"canonical-query-string\">Canonical Query String</h3>\n<p>Scalr uses the same format as AWS, with the added clarification that sorting\nthe pairs should be done prior to encoding them. Format follows:</p>\n<blockquote>\n<p>Add the query string components (the name-value pairs, not including the initial question mark (<code>?</code>) as UTF-8 characters which are URL encoded per RFC 3986 (hexadecimal characters must be uppercased) and sorted using lexicographic byte ordering. Lexicographic byte ordering is case sensitive. </p>\n<p>Separate parameter names from their values with the equal sign character (<code>=</code>) (ASCII character 61), even if the value is empty. Separate pairs of parameter and values with the ampersand character (<code>&amp;</code>) (ASCII code 38). All reserved characters must be escaped. All unreserved characters must not be escaped. Concatenate the parameters and their values to make one long string with no spaces between them. Spaces within a parameter value, are allowed, but must be URL encoded as <code>%20</code>. In the concatenated string, period characters (<code>.</code>) are not escaped. RFC 3986 considers the period character an unreserved character, and thus it is not URL encoded. </p>\n</blockquote>\n<p class=\"note\">RFC 3986 does not specify what happens with ASCII control characters, extended UTF-8 characters, and other characters reserved by RFC 1738. Since any values may be passed into a string value, these other characters should be percent encoded as <code>%XY</code> where <code>X</code> and <code>Y</code> are uppercase hex characters. Extended UTF-8 characters take the form <code>%XY%ZA...</code> (this handles multi-bytes). The space character should be represented as <code>%20</code>. Spaces should not be encoded as the plus sign (<code>+</code>) as this will cause as error.</p>\n\n<h2 id=\"signature-validity\">Signature Validity</h2>\n<p>The signature is valid for 5 minutes before the date, and 5 minutes after the\ndate passed in <code>X-Scalr-Date</code>.</p>\n<h2 id=\"x-scalr-debug\"><em>X-Scalr-Debug</em></h2>\n<p>We currently support an additional header (<code>X-Scalr-Debug</code>) that,\nwhen set to 1, causes Scalr to return the canonical request, to help users\ndebug their implementation (this has no security impact either, considering\nthat if an attacker sees the request, they could compute the canonical request\nanyway, but that doesn't help them sign it).</p>\n</div>\n", "title": "Authentication - Scalr API Documentation"}